
const sxArr = [
    {
        "id":1,  
        "sx":"蛇",   //生肖
        "hm":["01","13","25","37","49"],  //码数
        "bose":["red","red","blue","blue","green"],  //波色
        "mswux":["火","水","金","木","土"],    //五行
        "sxwux":"火",  //生肖五行
        "jy":"野兽",  //家野
        "yy":"阴",    //阴阳
        "mc":"美",    //美丑
        "jx":"吉",    //吉凶
        "td":"天",   //天地
        "qh":"前",   //前后
        "lr":"左",   //左右
        "duhe":"合", //独合
        "xc":"猪",   //相冲
        "sanh":"牛蛇鸡",  //三合
        "liuh":"蛇猴",   //六合
        "siji":"夏",    //四季
        "sxdh":"四大美女",  //生肖代号
        "tmdh":"宫女、才人、美女、太子、竹花",  //特码代号
        "qqsh":"琴"  //琴棋书画
    },
    {
        "id":2,
        "sx":"龙",    //生肖
        "hm":["02","14","26","38"],   //码数
        "bose":["red","blue","blue","green"], //波色
        "mswux":["火","水","金","木"],  //五行
        "sxwux":"土",  //生肖五行
        "jy":"野兽",   //家野
        "yy":"阴",   //阴阳
        "mc":"美",   //美丑
        "jx":"吉",   //吉凶
        "td":"天",   //天地
        "qh":"前",   //前后
        "lr":"左",   //左右
        "duhe":"合", //独合
        "xc":"狗",   //相冲
        "sanh":"鼠龙猴",  //三合
        "liuh":"龙鸡",   //六合
        "siji":"春",    //四季
        "sxdh":"两大君王",  //生肖代号
        "tmdh":"皇帝、状元、皇帝、上帝、梨花",   //特码代号
        "qqsh":"书"    //琴棋书画
    },
    {
        "id":3,
        "sx":"兔",    //生肖
        "hm":["03","15","27","39"],   //码数
        "bose":["blue","blue","green","green"], //波色
        "mswux":["金","木","土","火"],  //五行
        "sxwux":"木",  //生肖五行
        "jy":"野兽",   //家野
        "yy":"阳",   //阴阳
        "mc":"美",   //美丑
        "jx":"吉",   //吉凶
        "td":"天",   //天地
        "qh":"前",   //前后
        "lr":"右",   //左右
        "duhe":"独", //独合
        "xc":"鸡",   //相冲
        "sanh":"兔羊猪",  //三合
        "liuh":"兔狗",   //六合
        "siji":"春",    //四季
        "sxdh":"四大美女",  //生肖代号
        "tmdh":"玉帝、东宫、小姐、东宫、兰花",   //特码代号
        "qqsh":"琴"    //琴棋书画
    },
    {
        "id":4,
        "sx":"虎",    //生肖
        "hm":["04","16","28","40"],   //码数
        "bose":["blue","green","green","red"], //波色
        "mswux":["金","木","土","火"],  //五行
        "sxwux":"木",  //生肖五行
        "jy":"野兽",   //家野
        "yy":"阳",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"地",   //天地
        "qh":"前",   //前后
        "lr":"右",   //左右
        "duhe":"独", //独合
        "xc":"猴",   //相冲
        "sanh":"虎马狗",  //三合
        "liuh":"虎猪",   //六合
        "siji":"春",    //四季
        "sxdh":"两大君王",  //生肖代号
        "tmdh":"大将、大王、武士、都督、桃花",   //特码代号
        "qqsh":"书"    //琴棋书画
    },
    {
        "id":5,
        "sx":"牛",    //生肖
        "hm":["05","17","29","41"],   //码数
        "bose":["green","green","red","blue"], //波色
        "mswux":["土","火","水","金"],  //五行
        "sxwux":"土",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阳",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"天",   //天地
        "qh":"前",   //前后
        "lr":"左",   //左右
        "duhe":"独", //独合
        "xc":"羊",   //相冲
        "sanh":"牛蛇鸡",  //三合
        "liuh":"鼠牛",   //六合
        "siji":"冬",    //四季
        "sxdh":"四大家臣",  //生肖代号
        "tmdh":"无帅、大将、员外、大将、荷花",   //特码代号
        "qqsh":"棋"    //琴棋书画
    },
    {
        "id":6,
        "sx":"鼠",    //生肖
        "hm":["06","18","30","42"],   //码数
        "bose":["green","red","red","blue"], //波色
        "mswux":["土","火","水","金"],  //五行
        "sxwux":"水",  //生肖五行
        "jy":"野兽",   //家野
        "yy":"阴",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"地",   //天地
        "qh":"前",   //前后
        "lr":"左",   //左右
        "duhe":"独", //独合
        "xc":"马",   //相冲
        "sanh":"鼠龙猴",  //三合
        "liuh":"鼠牛",   //六合
        "siji":"冬",    //四季
        "sxdh":"两大恶人",  //生肖代号
        "tmdh":"国师、叛贼、神偷、叛贼、梅花",   //特码代号
        "qqsh":"棋"    //琴棋书画
    },
    {
        "id":7,
        "sx":"猪",    //生肖
        "hm":["07","19","31","43"],   //码数
        "bose":["red","red","blue","green"], //波色
        "mswux":["木","土","火","水"],  //五行
        "sxwux":"水",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阴",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"天",   //天地
        "qh":"后",   //前后
        "lr":"右",   //左右
        "duhe":"合", //独合
        "xc":"蛇",   //相冲
        "sanh":"兔羊猪",  //三合
        "liuh":"虎猪",   //六合
        "siji":"冬",    //四季
        "sxdh":"四大家臣",  //生肖代号
        "tmdh":"西宫、太监、商贾、太监、桂花",   //特码代号
        "qqsh":"画"    //琴棋书画
    },
    {
        "id":8,
        "sx":"狗",    //生肖
        "hm":["08","20","32","44"],   //码数
        "bose":["red","blue","green","green"], //波色
        "mswux":["木","土","火","水"],  //五行
        "sxwux":"土",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阴",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"地",   //天地
        "qh":"后",   //前后
        "lr":"右",   //左右
        "duhe":"合", //独合
        "xc":"龙",   //相冲
        "sanh":"虎马狗",  //三合
        "liuh":"兔狗",   //六合
        "siji":"秋",    //四季
        "sxdh":"四大家臣",  //生肖代号
        "tmdh":"文官、先锋、管家、先锋、菊花",   //特码代号
        "qqsh":"棋"    //琴棋书画
    },
    {
        "id":9,
        "sx":"鸡",    //生肖
        "hm":["09","21","33","45"],   //码数
        "bose":["blue","green","green","red"], //波色
        "mswux":["火","水","金","木"],  //五行
        "sxwux":"金",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阳",   //阴阳
        "mc":"美",   //美丑
        "jx":"吉",   //吉凶
        "td":"地",   //天地
        "qh":"后",   //前后
        "lr":"左",   //左右
        "duhe":"合", //独合
        "xc":"兔",   //相冲
        "sanh":"牛蛇鸡",  //三合
        "liuh":"龙鸡",   //六合
        "siji":"秋",    //四季
        "sxdh":"四大美女",  //生肖代号
        "tmdh":"东宫、贵妃、歌女、贵妃、苓花",   //特码代号
        "qqsh":"琴"    //琴棋书画
    },
    {
        "id":10,
        "sx":"猴",    //生肖
        "hm":["10","22","34","46"],   //码数
        "bose":["blue","green","red","red"], //波色
        "mswux":["火","水","金","木"],  //五行
        "sxwux":"金",  //生肖五行
        "jy":"野兽",   //家野
        "yy":"阳",   //阴阳
        "mc":"丑",   //美丑
        "jx":"凶",   //吉凶
        "td":"天",   //天地
        "qh":"后",   //前后
        "lr":"左",   //左右
        "duhe":"合", //独合
        "xc":"虎",   //相冲
        "sanh":"鼠龙猴",  //三合
        "liuh":"蛇猴",   //六合
        "siji":"秋",    //四季
        "sxdh":"两大恶人",  //生肖代号
        "tmdh":"太监、寇王、游侠、寇王、松树",   //特码代号
        "qqsh":"画"    //琴棋书画
    },
    {
        "id":11,
        "sx":"羊",    //生肖
        "hm":["11","23","35","47"],   //码数
        "bose":["green","red","red","blue"], //波色
        "mswux":["金","木","土","火"],  //五行
        "sxwux":"土",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阳",   //阴阳
        "mc":"美",   //美丑
        "jx":"吉",   //吉凶
        "td":"地",   //天地
        "qh":"后",   //前后
        "lr":"右",   //左右
        "duhe":"独", //独合
        "xc":"牛",   //相冲
        "sanh":"兔羊猪",  //三合
        "liuh":"马羊",   //六合
        "siji":"夏",    //四季
        "sxdh":"四大美女",  //生肖代号
        "tmdh":"相将、西宫、夫人、西宫、樱花",   //特码代号
        "qqsh":"画"    //琴棋书画
    },
    {
        "id":12,
        "sx":"马",    //生肖
        "hm":["12","24","36","48"],   //码数
        "bose":["red","red","blue","blue"], //波色
        "mswux":["金","木","土","火"],  //五行
        "sxwux":"火",  //生肖五行
        "jy":"家禽",   //家野
        "yy":"阴",   //阴阳
        "mc":"美",   //美丑
        "jx":"吉",   //吉凶
        "td":"天",   //天地
        "qh":"后",   //前后
        "lr":"右",   //左右
        "duhe":"独", //独合
        "xc":"牛",   //相冲
        "sanh":"虎马狗",  //三合
        "liuh":"马羊",   //六合
        "siji":"夏",    //四季
        "sxdh":"四大家臣",  //生肖代号
        "tmdh":"太子、元帅、秀才、太子、杏花",   //特码代号
        "qqsh":"书"    //琴棋书画
    }
]


export { sxArr };


